-- MySQL dump 10.13  Distrib 8.0.23, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: newlibrary
-- ------------------------------------------------------
-- Server version	8.0.23

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `readers`
--

DROP TABLE IF EXISTS `readers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `readers` (
  `idReaders` int NOT NULL AUTO_INCREMENT,
  `Familia` varchar(45) DEFAULT NULL,
  `Imya` varchar(45) DEFAULT NULL,
  `Otchestvo` varchar(45) DEFAULT NULL,
  `birthday` date DEFAULT NULL,
  `pol` varchar(45) DEFAULT NULL,
  `adress` varchar(150) DEFAULT NULL,
  `phone` varchar(45) DEFAULT NULL,
  `pasport` char(10) DEFAULT NULL,
  PRIMARY KEY (`idReaders`)
) ENGINE=InnoDB AUTO_INCREMENT=32 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `readers`
--

LOCK TABLES `readers` WRITE;
/*!40000 ALTER TABLE `readers` DISABLE KEYS */;
INSERT INTO `readers` VALUES (1,'Богатырев','Бенцион','Иванович','1982-05-29','М','ул. Очаковская Б., дом 174, квартира 351','+7 (906) 880-68-06','9468572131'),(2,'Астахова','Епастения','Ильинична','1984-10-23','Ж','ул. Донской 2-й проезд, дом 73, квартира 911','+7 (977) 761-48-61','1534986725'),(3,'Гуров','Уно','Евгеньевич','1970-08-16','М','ул. Побежимова, дом 85, квартира 589','+7 (916) 508-19-81','7375478861'),(4,'Яндутов','Тамерлан','Викторович','1991-05-12','М','ул. Воскова, дом 170, квартира 986','+7 (962) 255-41-56','8142856332'),(5,'Андрианов','Малх','Эльдарович','1996-06-10','М','ул. Армянское кл-ще тер, дом 138, квартира 623','+7 (921) 008-56-45','2154235645'),(6,'Шахуро','Абдумуталли','Станиславович','1978-08-08','М','ул. Автово ст, дом 70, квартира 532','+7 (951) 231-34-22','7856345324'),(7,'Романов','Дахир','Валентинович','1970-09-17','М','ул. Ножовый пер, дом 105, квартира 855','+7 (988) 527-17-06','4735365434'),(8,'Изофатова','Едуарда','Платоновна','1985-05-27','Ж','ул. Мирской проезд, дом 56, квартира 66','+7 (945) 737-60-98','2325345678'),(9,'Осипова','Анеша','Владиславовна','1988-09-18','Ж','ул. Печатников, дом 62, квартира 147','+7 (904) 448-65-72','4574376587'),(10,'Абрамов','Игнатиус','Геннадиевич','1973-03-02','М','ул. 8 Кордон, дом 107, квартира 329','+7 (922) 159-21-97','5383542566'),(11,'Никитина','Гузель','Иосифовна','1998-06-12','Ж','ул. Восточный 3-й пер, дом 161, квартира 659','+7 (954) 355-46-07','5364286797'),(12,'Садовничая','Иринида','Олеговна','1987-09-03','Ж','ул. Серафимовича 1-й пер, дом 18, квартира 527','+7 (977) 604-26-87','4388349754'),(13,'Владимирова','Алезия','Васильевна','1999-06-23','Ж','ул. Северная 6-я линия, дом 24, квартира 687','+7 (963) 893-33-37','5467374678'),(14,'Осипов','Вуди','Викторович','2000-07-11','М','ул. Средний пер, дом 88, квартира 636','+7 (901) 450-28-60','4563473578'),(15,'Архипова','Гулькай','Богдановна','1975-02-12','Ж','ул. Перуновский пер, дом 191, квартира 785','+7 (980) 951-62-46','3456236247'),(16,'Кудрявцев','Марсдон','Станиславович','2001-05-15','М','ул. Верхний 6-й пер, дом 154, квартира 334','+7 (984) 637-12-52','3452236878'),(17,'Сомова','Любова','Егоровна','1999-05-04','Ж','ул. Трикотажный 8-й пер, дом 143, квартира 691','+7 (969) 136-80-09','2645674577'),(18,'Пономарёв','Шевери','Борисович','2000-03-07','М','ул. Амосова, дом 55, квартира 24','+7 (972) 723-06-31','5754685857'),(19,'Трифонова','Гульаим','Викторовна','1996-08-06','Ж','ул. Карьерный Лог пер, дом 10, квартира 466','+7 (982) 514-22-51','3575689458'),(20,'Трифонов','Алейз','Григорьевич','1980-09-12','М','ул. 8 Марта 4-я, дом 50, квартира 242','+7 (951) 853-64-53','3452354665'),(21,'Галкин','Мустафакул','Максимович','1998-08-20','М','ул. Сивцев Вражек пер, дом 169, квартира 372','+7 (992) 622-76-89','4356564375'),(22,'Иванов','Иван','Иванович','1994-06-30','М','вооон там','+79884375235','3475869374'),(23,'а','а','а','1984-06-06','М','п','789765445678','7654345679'),(24,'Иванов','Иван','Иванович','1994-07-16','М','Москва','+79897463496','8754987345'),(25,'Иванов','Иван','Иванович','1994-07-16','М','Москва','+79897463496','8754987345'),(26,'Иванов','Иван','Иванович','1994-07-16','М','Москва','+79897463496','8754987345'),(27,'Иванов','Иван','Иванович','1994-07-16','М','Москва','+79897463496','8754987345'),(28,'Иванов','Иван','Иванович','1994-07-16','М','Москва','+79897463496','8754987345'),(29,'Иванов','Иван','Иванович','1994-07-16','М','Москва','+79897463496','8754987345'),(30,'Иванов','Иван','Иванович','1994-07-16','М','Москва','+79897463496','8754987345'),(31,'Иванов','Иван','Иванович','2021-04-30','М','Москва','+79897463496','8754987345');
/*!40000 ALTER TABLE `readers` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-05-03 13:23:39
